Autodesk.Revit.DB.LineSegment.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.LineSegment.LineProperties
Access to the line (pen) properties of the line
Since:
2016

Autodesk.Revit.DB.LineSegment.EndParameter
Parameter associated with the end point.
Since:
2016

Autodesk.Revit.DB.LineSegment.StartParameter
Parameter associated with the start point.
Since:
2016

Autodesk.Revit.DB.LineSegment.EndPoint
End point of the line segment.
Since:
2016

Autodesk.Revit.DB.LineSegment.StartPoint
Start point of the line segment.
Since:
2016

Autodesk.Revit.DB.LineSegment
An output node that represents a tessellated line segment.
Remarks:
See also: Autodesk::Revit::DB::IModelExportContext::OnLineSegment.
Since:
2016